bench/3_dynamic_nginx_cache.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        615 bytes

Concurrency Level:      50
Time taken for tests:   0.374 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      1714000 bytes
HTML transferred:       1230000 bytes
Requests per second:    5351.51 [#/sec] (mean)
Time per request:       9.343 [ms] (mean)
Time per request:       0.187 [ms] (mean, across all concurrent requests)
Transfer rate:          4478.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   1.8      3       8
Processing:     1    6   2.3      5      13
Waiting:        0    4   1.9      4      12
Total:          4    9   2.6      9      17

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     11
  75%     11
  80%     12
  90%     13
  95%     13
  98%     14
  99%     15
 100%     17 (longest request)