bench/5_static_gunicorn.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8082

Document Path:          /
Document Length:        2126 bytes

Concurrency Level:      50
Time taken for tests:   0.701 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      4562000 bytes
HTML transferred:       4252000 bytes
Requests per second:    2852.16 [#/sec] (mean)
Time per request:       17.531 [ms] (mean)
Time per request:       0.351 [ms] (mean, across all concurrent requests)
Transfer rate:          6353.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.1      0       9
Processing:     4   17   3.2     16      27
Waiting:        1   16   3.2     16      26
Total:          9   17   2.9     16      27

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     18
  75%     20
  80%     20
  90%     21
  95%     22
  98%     23
  99%     25
 100%     27 (longest request)